src/Documents/УведомлениеМЭДО/УведомлениеМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УведомлениеМЭДО</name>
  <registerRecords>InformationRegister.СостоянияДокументовМЭДО</registerRecords>
  <attributes>
    <name>ВерсияМЭДО</name>
    <comment>Хранится &quot;для истории&quot;, при отправке первична версия в настройках контрагента</comment>
    <type>
      <types>EnumRef.ВерсииФорматаМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ГотовоКОтправке</name>
    <comment>Для исходящего</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеКонверта</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеСообщения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DefinedType.ПредметМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторИсходящегоСообщения</name>
    <comment>Для входящего уведомления</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторУведомления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Не более 2047 символов</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.НаправленияСообщенийМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.ОтветственныйМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлено</name>
    <comment>Для исходящего</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУведомления</name>
    <type>
      <types>EnumRef.ТипыУведомленийМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулировкаУведомления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НаправлениеДоклада</name>
    <comment>reportSent</comment>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Юрлицо</name>
      <type>
        <types>DefinedType.ЮрлицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>DefinedType.КонтактноеЛицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РегистрационныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Опубликование</name>
    <comment>documentPublished</comment>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПечатныйОрган</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>511</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РегистрационныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтказВРегистрации</name>
    <comment>documentRefused</comment>
    <attributes>
      <name>ПричинаОтказа</name>
      <type>
        <types>CatalogRef.ПричиныОтказаВРегистрацииМЭДО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодготовкаДоклада</name>
    <comment>reportPrepared</comment>
    <attributes>
      <name>ДатаПодписания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийПодписания</name>
      <comment>максимум 2047 символов</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Юрлицо</name>
      <type>
        <types>DefinedType.ЮрлицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>DefinedType.КонтактноеЛицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостановкаНаКонтроль</name>
    <comment>documentSent</comment>
    <attributes>
      <name>ТребуетсяРегистрация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяИсполнение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяПубликация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктыДокументаПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостановкаНаКонтроль_КонтрольныеПунктыДокумента</name>
    <attributes>
      <name>ИдентификаторПункта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>127</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <comment>максимум 2047 символов</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Юрлицо</name>
      <type>
        <types>DefinedType.ЮрлицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПоПорядку</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>DefinedType.КонтактноеЛицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокИсполнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстПункта</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПринятиеКИсполнению</name>
    <comment>executorAssigned</comment>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>DefinedType.КонтактноеЛицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсполнительПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийИсполнителя</name>
      <comment>не больше 2047 символов</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийРуководителяПодразделения</name>
      <comment>не больше 2047 символов</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийРуководителяСекретаря</name>
      <comment>не больше 2047 символов</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Юрлицо</name>
      <type>
        <types>DefinedType.ЮрлицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>РуководительПодразделения</name>
      <type>
        <types>DefinedType.КонтактноеЛицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>РуководительПодразделенияПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РуководительСекретарь</name>
      <type>
        <types>DefinedType.КонтактноеЛицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>РуководительСекретарьПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Регистрация</name>
    <comment>documentAccepted</comment>
    <attributes>
      <name>РегистрационныйНомер</name>
      <type>
        <types>DefinedType.РегистрационныйНомер</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ХодИсполнения</name>
    <comment>courseChanged</comment>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Юрлицо</name>
      <type>
        <types>DefinedType.ЮрлицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеХодаИсполнения</name>
      <comment>до 4000 символов</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>DefinedType.КонтактноеЛицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РегистрационныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/CommonModules/МЭДОКлиент/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Стандартная структура-контруктор простого ответа без файла, для передачи на клиент.
// 
// Возвращаемое значение:
//  Структура - Новый легкий ответ:
//   * Успех - Булево
//   * СообщениеОбОшибке - Строка 
Функция НовыйЛегкийОтвет() Экспорт
	
	Данные = Новый Структура();
	Данные.Вставить("Успех", Истина);
	Данные.Вставить("СообщениеОбОшибке", "");
	
	Возврат Данные;
	
КонецФункции

// Процедура - Начинает подписание и отправку исходящих документов, вызывая описание оповещения при
// завершении и фиксируя состояние отправки.
//
// Параметры:
//   Организация - ОпределяемыйТип.Организация - Организация.
//   ИсходящиеДокументы - Массив из ОпределяемыйТип.ПредметМЭДО - Массив ссылок на исходящие документы.
//   Форма - ФормаКлиентскогоПриложения - форма, откуда вызывается отправка.
//   ОписаниеОповещения - ОписаниеОповещения - оповещение, вызываемое при завершении, с параметром:
//     Соответствие из Структура, где ключ - документ, а значение - Структура, см. МЭДОСтруктурыДанных.НовыйЛегкийОтвет.
//
Процедура НачатьОтправкуИсходящихДокументов(Организация, ИсходящиеДокументы, Форма, ОписаниеОповещения) Экспорт
	
	ОчиститьСообщения();
	
	Настройки = МЭДОВызовСервера.ПолучитьНастройкиОрганизации(
		Организация, "Организация, КаталогОтправки, РазмерПорции");
	Если Настройки = Неопределено Тогда
		ПоказатьПредупреждение( , 
			НСтр("ru = 'Отменено. В настройках организации не указан каталог для помещения файлов отправки'"));
		Возврат;
	КонецЕсли;
	
	Путь = Настройки.КаталогОтправки;
	
	
	ОписаниеДанных = Новый Структура();
	ОписаниеДанных.Вставить("Операция", НСтр("ru = 'Подписание для отправки по МЭДО'"));
	ОписаниеДанных.Вставить("ЗаголовокДанных", НСтр("ru = 'Исходящие документы'"));
	ОписаниеДанных.Вставить("ПредставлениеНабора", 
		СтрШаблон(НСтр("ru = 'Исходящие документы (%1)'"), ИсходящиеДокументы.Количество()));
	
	АдресДанныхДокументов = ПоместитьВоВременноеХранилище(Неопределено, Форма.УникальныйИдентификатор);
	НаборДанных = МЭДОВызовСервера.НаборДанныхИсходящихДокументовДляПодписания(ИсходящиеДокументы, АдресДанныхДокументов);
	ОписаниеДанных.Вставить("НаборДанных", НаборДанных);
	
	ПараметрыОповещения = Новый Структура(
		"Путь, АдресДанныхДокументов, ОписаниеОповещения",
		Путь, АдресДанныхДокументов, ОписаниеОповещения);
	ОбработкаРезультата = Новый ОписаниеОповещения(
		"ПослеПодписанияКонтейнеровИсходящихДокументов", ЭтотОбъект, ПараметрыОповещения);
	
	РезультатБезПодписания = Новый Структура(
		"Успех, НаборДанных",
		Истина, Новый Массив());
	ВыполнитьОбработкуОповещения(ОбработкаРезультата, РезультатБезПодписания);

КонецПроцедуры

// Процедура - Вызывается после подписания контейнеров и продолжает отправку исходящих документов.
//
// Параметры:
//   ОписаниеДанных - Структура - Структура со свойствами:
//     * Успех - Булево - Истина, если подписание завершено успешно.
//     * НаборДанных - Массив из Структура - массив структур со свойством СвойствоПодписи (см. ЭлектроннаяПодписьКлиент.Подписать).
//   ПараметрыОповещения - Структура - Со свойствами:
//     * Путь - Строка - путь выгрузки.
//     * АдресДанныхДокументов - Строка - адрес данных документов во временном хранилище.
//     * ОписаниеОповещения - ОписаниеОповещения - оповещение, вызваемое при успехе.
//
Процедура ПослеПодписанияКонтейнеровИсходящихДокументов(ОписаниеДанных, ПараметрыОповещения) Экспорт
	
	Если Не ОписаниеДанных.Успех Тогда
		МЭДОВызовСервера.УдалитьВременныеФайлы(ПараметрыОповещения.АдресДанныхДокументов);
		Возврат;
	КонецЕсли;
	
	Подписи = Новый Соответствие;
	Для Каждого ЭлементНабора Из ОписаниеДанных.НаборДанных Цикл
		Подписи[ЭлементНабора.СвойстваПодписи.Объект] = ЭлементНабора.СвойстваПодписи.Подпись;
	КонецЦикла;
	
	Результат = МЭДОВызовСервера.ЗаписатьСообщенияПоИсходящимДокументамПослеПодписания(
		ПараметрыОповещения.Путь, ПараметрыОповещения.АдресДанныхДокументов, Подписи);
	
	Если ТипЗнч(ПараметрыОповещения.ОписаниеОповещения) = Тип("ОписаниеОповещения") Тогда
		ВыполнитьОбработкуОповещения(ПараметрыОповещения.ОписаниеОповещения, Результат);
	КонецЕсли;
	
КонецПроцедуры


// Создать ответное уведомление на входящий документ. Сначала дает выбрать тип уведомления, потом открывает форму
// документа - "Уведомление МЭДО".
// 
// Параметры:
//  Документ - ОпределяемыйТип.ПредметМЭДО
//  ФормаВладелец - ФормаКлиентскогоПриложения - Форма-владелец, вызвавшая процедуру
Процедура СоздатьОтветноеУведомление(Документ, ФормаВладелец) Экспорт
	
	Фраза = СтрШаблон(
		НСтр("ru = 'Укажите тип ответного уведомления на документ %1
		|Будет создано ответное уведомление для последующей отправки.'"),
		Документ);
	ТипУведомления = Неопределено;
	ДопПараметры = Новый Структура("Документ, ФормаВладелец", Документ, ФормаВладелец);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеВводаТипаУведомления", ЭтотОбъект, ДопПараметры);
	ПоказатьВводЗначения(
		ОписаниеОповещения, ТипУведомления, Фраза, Тип("ПеречислениеСсылка.ТипыУведомленийМЭДО"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗавершениеВводаТипаУведомления(ТипУведомления, ДопПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(ТипУведомления) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ОткрытиеИзФормы", Истина);
	ПараметрыФормы.Вставить("ЭтоСоздание", Истина);
	ПараметрыФормы.Вставить("ТипУведомления", ТипУведомления);
	ПараметрыФормы.Вставить("Документ", ДопПараметры.Документ);
	ОткрытьФорму("Документ.УведомлениеМЭДО.Форма.ФормаДокумента", ПараметрыФормы, ДопПараметры.ФормаВладелец);
	
КонецПроцедуры

#КонецОбласти
